In [1]:
import sqlite3

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\alirezaabadi\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (8.30.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (2.0.39)
Requirement already satisfied: sqlparse in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: decorator in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack-data in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\alirezaabadi\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\alirezaabadi\anaconda3\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\alirezaabadi\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing in c:\users\alirezaabadi\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\alirezaabadi\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\alirezaabadi\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [3]:
%load_ext sql

## connect to sqlite  database

In [9]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [10]:
%%sql

DROP TABLE IF EXISTS photos;
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    id       INTEGER PRIMARY KEY,
    username VARCHAR(50)
);

CREATE TABLE photos (
    id      INTEGER PRIMARY KEY,
    url     VARCHAR(200),
    user_id INTEGER
);

 * sqlite://
Done.
Done.
Done.
Done.

[]

In [6]:
%%sql

INSERT INTO users (id, username) VALUES
(1, 'monahan93'),
(2, 'pfeffer'),
(3, '99stroman'),
(4, 'sim3onis');

INSERT INTO photos (id, url, user_id) VALUES
(1, 'http://img1.jpg', 4),
(2, 'http://img2.jpg', 1),
(3, 'http://img3.jpg', 1),
(4, 'http://img4.jpg', 1),
(5, 'http://img5.jpg', 2),
(6, 'http://img6.jpg', 3),
(7, 'http://img6.jpg', 4);

 * sqlite://
4 rows affected.
7 rows affected.

[]

In [12]:
%%sql
SELECT name 
FROM sqlite_master 
WHERE type='table';

 * sqlite://
Done.

[('users',), ('photos',)]

In [14]:
%%sql
SELECT COUNT(*) AS n_rows FROM users

 * sqlite://
Done.

[(0,)]

In [15]:
%load_ext sql
%sql sqlite:///mytest.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [50]:
%%sql

DROP TABLE IF EXISTS photos;
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    username VARCHAR(50)
);

CREATE TABLE photos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    url VARCHAR(200),
    user_id INTEGER REFERENCES usres(id)
);

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
Done.
Done.

[]

In [51]:
%%sql

INSERT INTO users (username) VALUES
('monahan93'),
('pfeffer'),
('99stroman'),
('sim3onis');

   sqlite://
 * sqlite:///mytest.db
4 rows affected.

[]

In [52]:
%%sql
SELECT * FROM users;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'monahan93'), (2, 'pfeffer'), (3, '99stroman'), (4, 'sim3onis')]

In [53]:
%%sql

INSERT INTO photos (url, user_id) VALUES
('http://img1.jpg', 4),
('http://img2.jpg', 1),
('http://img3.jpg', 1),
('http://img4.jpg', 1),
('http://img5.jpg', 2),
('http://img6.jpg', 3),
('http://img6.jpg', 4);

   sqlite://
 * sqlite:///mytest.db
7 rows affected.

[]

In [54]:
%%sql
SELECT * FROM photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', 4),
 (2, 'http://img2.jpg', 1),
 (3, 'http://img3.jpg', 1),
 (4, 'http://img4.jpg', 1),
 (5, 'http://img5.jpg', 2),
 (6, 'http://img6.jpg', 3),
 (7, 'http://img6.jpg', 4)]

In [55]:
%pwd

'C:\\Users\\AlirezaAbadi\\psql_training'

In [56]:
!git init

Reinitialized existing Git repository in C:/Users/AlirezaAbadi/psql_training/.git/

In [57]:
!git remote -v

origin	https://github.com/alirezaghorbani1983/psql_training.git (fetch)
origin	https://github.com/alirezaghorbani1983/psql_training.git (push)

In [58]:
!git branch

* main

In [59]:
!git status

On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	modified:   mytest.db
	modified:   psql_1.ipynb

no changes added to commit (use "git add" and/or "git commit -a")

In [60]:
!git add .

warning: in the working copy of 'psql_1.ipynb', LF will be replaced by CRLF the next time Git touches it

In [61]:
!git commit -m "updated notebook"

[main 6dc1f59] updated notebook
 2 files changed, 32 insertions(+), 41 deletions(-)

In [63]:
!git push

Everything up-to-date

In [65]:
%%sql
insert into photos (url, user_id)
values ('http://jpg', 9999)

   sqlite://
 * sqlite:///mytest.db
1 rows affected.

[]

In [66]:
%%sql
SELECT * FROM photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', 4),
 (2, 'http://img2.jpg', 1),
 (3, 'http://img3.jpg', 1),
 (4, 'http://img4.jpg', 1),
 (5, 'http://img5.jpg', 2),
 (6, 'http://img6.jpg', 3),
 (7, 'http://img6.jpg', 4),
 (8, 'http://jpg', 9999),
 (9, 'http://jpg', 9999)]

In [68]:
%%sql

DROP TABLE IF EXISTS photos;
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    username VARCHAR(50)
);

CREATE TABLE photos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    url VARCHAR(200),
    user_id INTEGER REFERENCES users(id)
);

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
Done.
Done.

[]

In [69]:
%%sql 
PRAGMA foreign_keys = ON;

   sqlite://
 * sqlite:///mytest.db
Done.

[]

In [70]:
%%sql

INSERT INTO users (id, username) VALUES
(1, 'monahan93'),
(2, 'pfeffer'),
(3, '99stroman'),
(4, 'sim3onis');

INSERT INTO photos (id, url, user_id) VALUES
(1, 'http://img1.jpg', 4),
(2, 'http://img2.jpg', 1),
(3, 'http://img3.jpg', 1),
(4, 'http://img4.jpg', 1),
(5, 'http://img5.jpg', 2),
(6, 'http://img6.jpg', 3),
(7, 'http://img6.jpg', 4);

   sqlite://
 * sqlite:///mytest.db
4 rows affected.
7 rows affected.

[]

In [71]:
%%sql
SELECT * FROM users;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'monahan93'), (2, 'pfeffer'), (3, '99stroman'), (4, 'sim3onis')]

In [72]:
%%sql
SELECT * FROM photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', 4),
 (2, 'http://img2.jpg', 1),
 (3, 'http://img3.jpg', 1),
 (4, 'http://img4.jpg', 1),
 (5, 'http://img5.jpg', 2),
 (6, 'http://img6.jpg', 3),
 (7, 'http://img6.jpg', 4)]

In [73]:
%%sql
insert into photos (url, user_id)
values ('http://jpg', 9999)

   sqlite://
 * sqlite:///mytest.db
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert into photos (url, user_id)
values ('http://jpg', 9999)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [74]:
%%sql
insert into photos (url, user_id)
values ('http://jpg', NULL)

   sqlite://
 * sqlite:///mytest.db
1 rows affected.

[]

In [75]:
%%sql
SELECT * FROM photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', 4),
 (2, 'http://img2.jpg', 1),
 (3, 'http://img3.jpg', 1),
 (4, 'http://img4.jpg', 1),
 (5, 'http://img5.jpg', 2),
 (6, 'http://img6.jpg', 3),
 (7, 'http://img6.jpg', 4),
 (8, 'http://jpg', None)]

In [77]:
!git status

On branch main
Your branch is up to date with 'origin/main'.

Changes to be committed:
  (use "git restore --staged <file>..." to unstage)
	modified:   mytest.db
	modified:   psql_1.ipynb

In [78]:
!git commit -m "updated database and notebook"

[main a15e3b3] updated database and notebook
 2 files changed, 566 insertions(+), 24 deletions(-)

In [80]:
!git push

Everything up-to-date

In [81]:
%%sql
delete from users
where id = 1;

   sqlite://
 * sqlite:///mytest.db
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: delete from users
where id = 1;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [84]:
%%sql
DROP TABLE photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[]

## Using ON DELETE CASCADE

In [86]:
%%sql
CREATE TABLE photos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    url VARCHAR(200),
    user_id INTEGER REFERENCES users(id) ON DELETE CASCADE
);

INSERT INTO photos (id, url, user_id) VALUES
(1, 'http://img1.jpg', 4),
(2, 'http://img2.jpg', 1),
(3, 'http://img3.jpg', 1),
(4, 'http://img4.jpg', 1),
(5, 'http://img5.jpg', 2),
(6, 'http://img6.jpg', 3),
(7, 'http://img6.jpg', 4);

   sqlite://
 * sqlite:///mytest.db
Done.
7 rows affected.

[]

In [87]:
%%sql

delete from users 
where id = 1;

   sqlite://
 * sqlite:///mytest.db
1 rows affected.

[]

In [88]:
%%sql
select * from photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', 4),
 (5, 'http://img5.jpg', 2),
 (6, 'http://img6.jpg', 3),
 (7, 'http://img6.jpg', 4)]

In [89]:
!git commit -m "test ON DELETE CASCADE"

On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	modified:   mytest.db
	modified:   psql_1.ipynb

no changes added to commit (use "git add" and/or "git commit -a")

In [90]:
!git push

Everything up-to-date

## Using ON DELETE SET NULL

In [102]:
%%sql
DROP TABLE IF EXISTS photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[]

In [103]:
%%sql
CREATE TABLE photos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    url VARCHAR(200),
    user_id INTEGER REFERENCES users(id) ON DELETE SET NULL
);

INSERT INTO photos (url, user_id) VALUES
('http://img1.jpg', 4),
('http://img5.jpg', 2),
('http://img6.jpg', 3),
('http://img6.jpg', 4);

   sqlite://
 * sqlite:///mytest.db
Done.
4 rows affected.

[]

In [104]:
%%sql
delete from users
where id = 4;

   sqlite://
 * sqlite:///mytest.db
1 rows affected.

[]

In [105]:
%%sql
select * from photos;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'http://img1.jpg', None),
 (2, 'http://img5.jpg', 2),
 (3, 'http://img6.jpg', 3),
 (4, 'http://img6.jpg', None)]

In [108]:
!git add mytest.db psql_1.ipynb
!git commit -m "test ON DELETE SET NULL"

warning: in the working copy of 'psql_1.ipynb', LF will be replaced by CRLF the next time Git touches it

[main e2b209f] test ON DELETE SET NULL
 2 files changed, 545 insertions(+), 1 deletion(-)

In [110]:
!git push

Everything up-to-date

In [114]:
%%sql
DROP TABLE IF EXISTS comments;
DROP TABLE IF EXISTS photos;
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    id       INTEGER PRIMARY KEY AUTOINCREMENT,
    username TEXT NOT NULL
);

CREATE TABLE photos (
    id      INTEGER PRIMARY KEY AUTOINCREMENT,
    url     TEXT NOT NULL,
    user_id INTEGER,
    FOREIGN KEY(user_id) REFERENCES users(id)
);

CREATE TABLE comments (
    id       INTEGER PRIMARY KEY AUTOINCREMENT,
    contents TEXT NOT NULL,
    user_id  INTEGER,
    photo_id INTEGER,
    FOREIGN KEY(user_id) REFERENCES users(id),
    FOREIGN KEY(photo_id) REFERENCES photos(id)
);

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [115]:
%%sql
INSERT INTO users (username)
WITH RECURSIVE nums(x) AS (
    SELECT 1
    UNION ALL
    SELECT x+1 FROM nums WHERE x < 5
)
SELECT 'user_' || x FROM nums;

   sqlite://
 * sqlite:///mytest.db
5 rows affected.

[]

In [116]:
%%sql
INSERT INTO photos (url, user_id)
WITH RECURSIVE nums(x) AS (
    SELECT 1
    UNION ALL
    SELECT x+1 FROM nums WHERE x < 20
)
SELECT
    'https://example.com/photo_' || x AS url,
    ((x - 1) % 5) + 1 AS user_id
FROM nums;

   sqlite://
 * sqlite:///mytest.db
20 rows affected.

[]

In [117]:
%%sql
INSERT INTO comments (contents, user_id, photo_id)
WITH 
numbers AS (
    SELECT 1 AS n
    UNION ALL
    SELECT n+1 FROM numbers WHERE n < 100
),
comments_list AS (
    SELECT 1 AS id, 'Amazing picture!' AS c UNION ALL
    SELECT 2, 'Nice shot!' UNION ALL
    SELECT 3, 'Great colors!' UNION ALL
    SELECT 4, 'I love this!' UNION ALL
    SELECT 5, 'Beautiful photo.' UNION ALL
    SELECT 6, 'Wonderful view!' UNION ALL
    SELECT 7, 'So cool!' UNION ALL
    SELECT 8, 'Impressive work.' UNION ALL
    SELECT 9, 'Very interesting!' UNION ALL
    SELECT 10, 'Fantastic!' UNION ALL
    SELECT 11, 'Looks awesome!' UNION ALL
    SELECT 12, 'Really nice!' UNION ALL
    SELECT 13, 'Wow!' UNION ALL
    SELECT 14, 'Perfect timing.' UNION ALL
    SELECT 15, 'I like this composition.' UNION ALL
    SELECT 16, 'Brilliant!' UNION ALL
    SELECT 17, 'Stunning photo!' UNION ALL
    SELECT 18, 'Love this angle.' UNION ALL
    SELECT 19, 'Good job!' UNION ALL
    SELECT 20, 'Amazing detail.'
)
SELECT
    (SELECT c FROM comments_list ORDER BY RANDOM() LIMIT 1) AS contents,
    ((n - 1) % 5) + 1 AS user_id,
    ((n - 1) % 20) + 1 AS photo_id
FROM numbers;

   sqlite://
 * sqlite:///mytest.db
100 rows affected.

[]

In [118]:
%%sql
SELECT * FROM users;
SELECT * FROM photos LIMIT 5;
SELECT * FROM comments LIMIT 5;

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
Done.

[(1, 'Amazing detail.', 1, 1),
 (2, 'Amazing detail.', 2, 2),
 (3, 'Amazing detail.', 3, 3),
 (4, 'Amazing detail.', 4, 4),
 (5, 'Amazing detail.', 5, 5)]

In [119]:
%%sql

SELECT * FROM photos LIMIT 5;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'https://example.com/photo_1', 1),
 (2, 'https://example.com/photo_2', 2),
 (3, 'https://example.com/photo_3', 3),
 (4, 'https://example.com/photo_4', 4),
 (5, 'https://example.com/photo_5', 5)]

In [120]:
%%sql
SELECT * FROM users;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'user_1'), (2, 'user_2'), (3, 'user_3'), (4, 'user_4'), (5, 'user_5')]

In [121]:
%%sql
DELETE FROM comments;
DELETE FROM photos;
DELETE FROM users;

   sqlite://
 * sqlite:///mytest.db
100 rows affected.
20 rows affected.
5 rows affected.

[]

In [122]:
%%sql

DROP TABLE IF EXISTS comments;
DROP TABLE IF EXISTS photos;
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    username TEXT NOT NULL
);

CREATE TABLE photos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    url TEXT NOT NULL,
    user_id INTEGER REFERENCES users(id)
);

CREATE TABLE comments (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    contents TVARCHAR(240) NOT NULL,
    user_id INTEGER REFERENCES users(id),
    photo_id INTEGER REFERENCES photos(id)
);

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [123]:
%%sql
INSERT INTO users (username) VALUES
('reyna.marvin'),
('micah_cremin'),
('alfredo_66'),
('gerard.mitchell'),
('frederique.donnelly');

   sqlite://
 * sqlite:///mytest.db
5 rows affected.

[]

In [124]:
%%sql
INSERT INTO photos (url, user_id) VALUES
('https://santina.net/travel/sunset-lake.jpg',             3),
('https://alayna.net/street/blue-bike.jpg',               5),
('https://kailyn.name/forest/morning-light.png',          3),
('https://sasha.com/city/old-station.jpg',                1),
('https://images.example.com/food/french-breakfast.jpg',  2),
('https://images.example.com/people/friends-coffee.jpg',  4),
('https://photos.example.org/nature/mountain-road.jpg',   5),
('https://photos.example.org/sea/empty-beach.png',        1),
('https://cdn.example.net/architecture/red-bridge.jpg',   2),
('https://cdn.example.net/night/long-exposure-cars.jpg',  4),
('https://img.sharepics.com/animals/curious-cat.jpg',     3),
('https://img.sharepics.com/animals/dog-park.png',        2),
('https://media.mysite.com/events/street-festival.jpg',   1),
('https://media.mysite.com/music/concert-lights.jpg',     5),
('https://static.pics.com/minimal/desk-setup.jpg',        4),
('https://static.pics.com/work/remote-office.png',        1),
('https://files.example.com/art/graffiti-wall.jpg',       2),
('https://files.example.com/art/old-bookstore.png',       3),
('https://content.example.org/sport/morning-run.jpg',     4),
('https://content.example.org/kids/bubbles-park.png',     5);

   sqlite://
 * sqlite:///mytest.db
20 rows affected.

[]

In [125]:
%%sql
DROP TABLE IF EXISTS comment_templates;

CREATE TABLE comment_templates (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    contents VARCHAR(240)
);

INSERT INTO comment_templates (contents) VALUES
('Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),
('Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'),
('Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris.'),
('Duis aute irure dolor in reprehenderit in voluptate velit esse cillum.'),
('Excepteur sint occaecat cupidatat non proident.'),
('Curabitur blandit tempus porttitor. Etiam porta sem malesuada magna.'),
('Integer posuere erat a ante venenatis dapibus posuere velit aliquet.'),
('Cras mattis consectetur purus sit amet fermentum.'),
('Vestibulum id ligula porta felis euismod semper.'),
('Donec id elit non mi porta gravida at eget metus.'),
('Maecenas faucibus mollis interdum.'),
('Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.'),
('Nulla vitae elit libero, a pharetra augue.'),
('Praesent commodo cursus magna, vel scelerisque nisl consectetur.'),
('Morbi leo risus, porta ac consectetur ac, vestibulum at eros.');

   sqlite://
 * sqlite:///mytest.db
Done.
Done.
15 rows affected.

[]

In [127]:
%%sql
WITH RECURSIVE
    counter(x) AS (
        SELECT 1
        UNION ALL
        SELECT x + 1 FROM counter WHERE x < 100
    )
INSERT INTO comments (contents, user_id, photo_id)
SELECT
    (SELECT contents
     FROM comment_templates
     ORDER BY RANDOM()
     LIMIT 1),
    ((ABS(RANDOM()) % 5) + 1) AS user_id,      -- BETWEEN 1 TO 5
    ((ABS(RANDOM()) % 20) + 1) AS photo_id     -- between 1 to 20
FROM counter;

   sqlite://
 * sqlite:///mytest.db
Done.

[]

In [129]:
%%sql
SELECT id, contents, user_id, photo_id
FROM comments
LIMIT 10;

   sqlite://
 * sqlite:///mytest.db
Done.

[(1, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 4, 5),
 (2, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 4, 10),
 (3, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 3, 12),
 (4, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 5, 14),
 (5, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 3, 17),
 (6, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 4, 14),
 (7, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 5, 16),
 (8, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 5, 18),
 (9, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 2, 5),
 (10, 'Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis.', 4, 20)]